[
  {
    "ID": "CODX01",
    "BRAND": "Call of Duty",
    "PRODUCTNAME": "Call of Duty - Infinite Warfare",
    "GRAPHICNAME": "infinitewarfare.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Call of Duty: Infinite Warfare is a 2016 first-person shooter video game developed by Infinity Ward and published by Activision. It is the thirteenth installment in the Call of Duty series and was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on November 4, 2016."
  },
  {
    "ID": "CODX02",
    "BRAND": "Call of Duty",
    "PRODUCTNAME": "Call of Duty - Black Ops 3",
    "GRAPHICNAME": "blackops.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "21",
    "QTYONBACKORDER": "540",
    "DESCRIPTION": "Call of Duty: Black Ops III is a 2015 first-person shooter video game, developed by Treyarch and published by Activision. It is the twelfth entry in the Call of Duty series and the sequel to the 2012 video game Call of Duty: Black Ops II. It was released on Microsoft Windows, PlayStation 4, and Xbox One on November 6, 2015. A feature-limited version developed by Beenox and Mercenary Technology that only supports multiplayer modes was released on PlayStation 3 and Xbox 360 and was also the final Call of Duty title released on those platforms."
  },
  {
    "ID": "CODX03",
    "BRAND": "Call of Duty",
    "PRODUCTNAME": "Call of Duty - Modern Warfare",
    "GRAPHICNAME": "modernwarfare.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "112",
    "QTYONBACKORDER": "430",
    "DESCRIPTION": "Call of Duty: Modern Warfare is a 2019 first-person shooter video game developed by Infinity Ward and published by Activision. Serving as the sixteenth overall installment in the Call of Duty series, as well as a reboot of the Modern Warfare sub-series,[2][3][4] it was released on October 25, 2019, for Microsoft Windows, PlayStation 4, and Xbox One."
  },
  {
    "ID": "CODX04",
    "BRAND": "Call of Duty",
    "PRODUCTNAME": "Call of Duty - Cold War",
    "GRAPHICNAME": "coldwar.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Call of Duty: Black Ops Cold War is a 2020 first-person shooter video game developed by Treyarch and Raven Software and published by Activision. It was released worldwide on November 13, 2020, for Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One, and Xbox Series X and S. It serves as the sixth installment in the Black Ops series, and the seventeenth installment in the overall Call of Duty series. The game is the second Call of Duty title since 2011's Modern Warfare 3 to be co-developed by two studios."
  },
  {
    "ID": "CODX05",
    "BRAND": "Call of Duty",
    "PRODUCTNAME": "Call of Duty - World War 2",
    "GRAPHICNAME": "worldwar2.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Call of Duty: WWII is a 2017 first-person shooter video game developed by Sledgehammer Games and published by Activision. It was released worldwide on November 3, 2017 for Microsoft Windows, PlayStation 4 and Xbox One. It is the fourteenth main installment in the Call of Duty series and the first title in the series to be set primarily during World War II since Call of Duty: World at War in 2008."
  },
  {
    "ID": "BFX01",
    "BRAND": "Battlefield",
    "PRODUCTNAME": "Battlefield - Bad Company 2",
    "GRAPHICNAME": "badcompany.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Battlefield: Bad Company 2 is a first-person shooter video game developed by the Swedish firm DICE and published by Electronic Arts for Microsoft Windows, PlayStation 3, Xbox 360, iOS and Kindle Fire systems. It is a direct sequel to Battlefield: Bad Company and is part of the Battlefield game series. It was released worldwide in March 2010. The iOS port was released on the App Store on December 16, 2010.[9] A Kindle Fire version was released in June 2012."
  },
  {
    "ID": "BFX02",
    "BRAND": "Battlefield",
    "PRODUCTNAME": "Battlefield 3",
    "GRAPHICNAME": "bf3.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Battlefield 3 is a 2011 first-person shooter video game developed by DICE and published by Electronic Arts for Microsoft Windows, PlayStation 3 and Xbox 360. It is a direct sequel to 2005's Battlefield 2, and the seventh main installment in the Battlefield franchise."
  },
  {
    "ID": "BFX03",
    "BRAND": "Battlefield",
    "PRODUCTNAME": "Battlefield 4",
    "GRAPHICNAME": "bf4.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Battlefield 4 is a first-person shooter video game developed by video game developer DICE and published by Electronic Arts. It is a sequel to 2011's Battlefield 3, with the story taking place six years later during the fictional War of 2020. The title was first released in October 2013 for Microsoft Windows, PlayStation 3, and Xbox 360; then later in November for PlayStation 4 and Xbox One."
  },
  {
    "ID": "BFX04",
    "BRAND": "Battlefield",
    "PRODUCTNAME": "Battlefield 1",
    "GRAPHICNAME": "bf1.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Battlefield 1 is a first-person shooter video game developed by DICE and published by Electronic Arts. Battlefield 1 is the fifteenth installment in the Battlefield series,[1] and the first main entry in the series since Battlefield 4.[2] It was released worldwide for Microsoft Windows, PlayStation 4, and Xbox One on October 21, 2016."
  },
  {
    "ID": "BFX05",
    "BRAND": "Battlefield",
    "PRODUCTNAME": "Battlefield 2042",
    "GRAPHICNAME": "bf2042.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Battlefield 2042 is an upcoming first-person shooter video game developed by DICE and published by Electronic Arts. It is the seventeenth installment in the Battlefield series and the successor to 2018's Battlefield V. The title is scheduled to be released on October 22, 2021 for Microsoft Windows, PlayStation 4, PlayStation 5, Xbox One and Xbox Series X and Series S."
  },
  {
    "ID": "HLOX01",
    "BRAND": "Halo",
    "PRODUCTNAME": "Halo",
    "GRAPHICNAME": "halo.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Halo: Combat Evolved, also known as Halo: CE, is a first-person shooter game developed by Bungie and published by Microsoft Game Studios. It was released as a launch game for Microsoft's Xbox video game console on November 15, 2001. Microsoft released versions of the game for Windows and Mac OS X in 2003. The game was later released as a downloadable Xbox Original for the Xbox 360. Halo is set in the twenty-sixth century, with the player assuming the role of the Master Chief, a cybernetically enhanced supersoldier. The Chief is accompanied by Cortana, an artificial intelligence. Players battle aliens as they attempt to uncover the secrets of the eponymous Halo, a ring-shaped artificial world."
  },
  {
    "ID": "HLOX02",
    "BRAND": "Halo",
    "PRODUCTNAME": "Halo 2",
    "GRAPHICNAME": "halo2.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Halo 2 is a 2004 first-person shooter game developed by Bungie and published by Microsoft Game Studios for the Xbox console. Halo 2 is the second installment in the Halo franchise and the sequel to 2001's critically acclaimed Halo: Combat Evolved. The game features new weapons, enemies, and vehicles, and shipped with online multiplayer via Microsoft's Xbox Live service. In Halo 2's story mode, the player assumes the roles of the human Master Chief and the alien Arbiter in a 26th-century conflict between the human United Nations Space Command, the genocidal Covenant, and the parasitic Flood."
  },
  {
    "ID": "HLOX03",
    "BRAND": "Halo",
    "PRODUCTNAME": "Halo 3",
    "GRAPHICNAME": "halo3.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Halo 3 is a 2007 first-person shooter game developed by Bungie for the Xbox 360 console. The third installment in the Halo franchise, the game concludes the story arc begun in 2001's Halo: Combat Evolved and continued in 2004's Halo 2. Halo 3's story centers on the interstellar war between twenty-sixth century humanity, a collection of alien races known as the Covenant, and the alien parasite Flood. The player assumes the role of the Master Chief, a cybernetically enhanced supersoldier, as he battles the Covenant and the Flood. The game features vehicles, weapons, and gameplay elements not present in previous titles of the series, as well as the addition of saved gameplay films, file sharing, and the Forge map editor—a utility which allows the player to perform modifications to multiplayer levels."
  },
  {
    "ID": "HLOX04",
    "BRAND": "Halo",
    "PRODUCTNAME": "Halo 4",
    "GRAPHICNAME": "halo4.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Halo 4 is a 2012 first-person shooter video game developed by 343 Industries and published by Microsoft Studios for the Xbox 360 video game console. The fourth mainline installment and seventh overall in the Halo franchise. Halo 4's story follows a cybernetically enhanced human supersoldier, Master Chief, and his artificial intelligence construct Cortana, as they encounter unknown threats while exploring an ancient civilization's planet. The player assumes the role of Master Chief who battles against a new faction that splintered off from remnants of the Covenant, a former military alliance of alien races, and against mechanical warriors of the Forerunner empire known as the Prometheans. The game features a selection of weapons, enemies, and game modes not present in previous titles of the series."
  },
  {
    "ID": "HLOX05",
    "BRAND": "Halo",
    "PRODUCTNAME": "Halo 5",
    "GRAPHICNAME": "halo5.jpg",
    "COSTPRICE": "79.99",
    "MSRP": "79.99",
    "QTYONHAND": "2",
    "QTYONBACKORDER": "40",
    "DESCRIPTION": "Halo 5: Guardians is a 2015 first-person shooter video game developed by 343 Industries and published by Microsoft Studios for the Xbox One. The fifth mainline entry and tenth overall in the Halo series, it was released worldwide on October 27, 2015. The game's plot follows two fireteams of human supersoldiers: Blue Team, led by Master Chief, and Fireteam Osiris, led by Spartan Locke. When the former goes absent without leave to track down the artificial intelligence construct Cortana, Master Chief's loyalty is called into question and Fireteam Osiris is sent to retrieve him."
  }
]
